# bot/config.py

# ======================================================
# ЗАГАЛЬНІ НАЛАШТУВАННЯ БОТА
# ======================================================

BOT_STATUS = "Вирішую проблеми всесерверного масштабу..."
FOOTER_TEXT = "Stake RP ⭐ With Love"


# ======================================================
# GUILDS — де реєструються slash-команди
# ======================================================

GUILD_IDS = [
    1389902197096972331,  # State
    1422970996553683037,  # FIB
    758311495502659584,   # GOV
    1382394949449940992,  # EMS
    1382332841437958234,  # WN
    838776663457136690,   # LSCSD
    762567471885451277,   # LSPD
    1381728890724155474   # SANG
]


# ======================================================
# РОЛІ З ДОСТУПОМ ДО КУРАТОРСЬКИХ КОМАНД
# (/куратор_збори і подібні)
# ======================================================

ALLOWED_ROLE_IDS = [
    1389903859459293286, # curatorState
    1422971719873990843,  # curatorFIB
    758311495548534857,   # curatorGOV
    1382394949470785576,  # curatorEMS
    1382337032952479816,  # curatorWN
    838777454981283920,   # curatorLSCSD
    762589521060691978,   # curatorLSPD
    1381728890736869485   # curatorSANG
]


# ======================================================
# STATE FRACTIONS — ГОЛОВНИЙ СЕРВЕР
# ======================================================

# Сервер, де ВСІ збираються
STATE_MAIN_GUILD_ID = 1389902197096972331  # ⬅️ State Fractions | Stake RP

# Канал, де буде embed з кнопками
STATE_CHANNEL_ID = 1389904418182398016     # ⬅️ #state-fractions

# Роль "State Member"
STATE_MEMBER_ROLE_ID = 1389903927918461011 # ⬅️ State Member


# ======================================================
# ДЕРЖАВНІ ФРАКЦІЇ
# ======================================================
# guild_id — сервер фракції
# required_role_id — роль на фракційному сервері
# give_role_id — роль, яку видаємо НА STATE-СЕРВЕРІ

STATE_FACTIONS = {
    "FIB": {
        "label": "FIB | Stake RP",
        "guild_id": 1422970996553683037,
        "required_role_id": 1422974395277905940,
        "give_role_id": 1456185136486944768,
    },
    "LSPD": {
        "label": "LSPD | Stake RP",
        "guild_id": 762567471885451277,
        "required_role_id": 1465828485409800408,
        "give_role_id": 1456184448482545777,
    },
    "EMS": {
        "label": "EMS | Stake RP",
        "guild_id": 1382394949449940992,
        "required_role_id": 1382394949449940996,
        "give_role_id": 1456185215792975932,
    },
    "GOV": {
        "label": "Government | Stake RP",
        "guild_id": 758311495502659584,
        "required_role_id": 758311495502659592,
        "give_role_id": 1456187447116435519,
    },
    "SANG": {
        "label": "SANG | Stake RP",
        "guild_id": 1381728890724155474,
        "required_role_id": 1413238690771239032,
        "give_role_id": 1456185371887927449,
    },
    "WN": {
        "label": "Weazel News | Stake RP",
        "guild_id": 1382332841437958234,
        "required_role_id": 1382347415767482368,
        "give_role_id": 1456185281559527435,
    },
    "LSCSD": {
        "label": "LSCSD | Stake RP",
        "guild_id": 838776663457136690,
        "required_role_id": 1413796190293721128,
        "give_role_id": 1456184779430035560,
    },
}
